*** Sidebar config

 Show the repo structure in a similar way to VScode. Incompact on
 Melpa.

 #+begin_src emacs-lisp 
 ;; (use-package dired-sidebar
 ;;   :bind (("C-x C-n" . dired-sidebar-toggle-sidebar))
 ;;   :ensure t
 ;;   :commands (dired-sidebar-toggle-sidebar)
 ;;   :init
 ;;   (add-hook 'dired-sidebar-mode-hook
 ;;             (lambda ()
 ;;               (unless (file-remote-p default-directory)
 ;;                 (auto-revert-mode))))
 ;;   :config
 ;;   (push 'toggle-window-split dired-sidebar-toggle-hidden-commands)
 ;;   (push 'rotate-windows dired-sidebar-toggle-hidden-commands)

 ;;   (setq dired-sidebar-subtree-line-prefix "__")
 ;;   (setq dired-sidebar-theme 'vscode)
 ;;   (setq dired-sidebar-use-term-integration t)
 ;;   (setq dired-sidebar-use-custom-font t))
 #+end_src 

 : dired-sidebar-toggle-sidebar

 Was downloaded through git following the instruction on the [[https://github.com/jojojames/dired-sidebar][github
 repo]] in the meanwhile.

 #+begin_src emacs-lisp 
 (add-to-list 'load-path "/Users/marcohassan/.emacs.d/dired-sidebar")
 (add-to-list 'load-path "/Users/marcohassan/.emacs.d/dired-hacks")
 #+end_src  

 #+begin_src emacs-lisp 
 (load "dired-sidebar")
 #+end_src 
 : t

 Configuration

 #+begin_src emacs-lisp 
 (push 'toggle-window-split dired-sidebar-toggle-hidden-commands)
 (push 'rotate-windows dired-sidebar-toggle-hidden-commands)
 
 ;; (setq dired-sidebar-subtree-line-prefix "__")
 (setq dired-sidebar-theme 'vscode)
 (setq dired-sidebar-use-term-integration t)
 (setq dired-sidebar-use-custom-font t)
 #+end_src 

Also change the default sidebar width.

#+begin_src emacs-lisp 
(setq dired-sidebar-width 20)
#+end_src 

Enlarge dired-sidebar

#+begin_src emacs-lisp 
(defun enlarge_sidebar()
  "Convert a multi-line paragraph into a single line of text."
  (interactive)
   (dired-sidebar-toggle-sidebar)
   (setq dired-sidebar-width (+ 5 dired-sidebar-width))
   (dired-sidebar-toggle-sidebar)
  )


(defun shrink_sidebar()
  "Convert a multi-line paragraph into a single line of text."
  (interactive)
   (dired-sidebar-toggle-sidebar)
   (setq dired-sidebar-width (- dired-sidebar-width 5))
   (dired-sidebar-toggle-sidebar)
  )

(defun default_sidebar()
  "Convert a multi-line paragraph into a single line of text."
  (interactive)
   (dired-sidebar-toggle-sidebar)  
   (setq dired-sidebar-width 20)
   (dired-sidebar-toggle-sidebar)   
  )

;; bind the two in dired mode
(add-hook 'dired-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c <") 'shrink_sidebar)
            (local-set-key (kbd "C-c >") 'enlarge_sidebar)
	    (local-set-key (kbd "C-c C-d") 'default_sidebar))
	  )
#+end_src 

#+RESULTS:
| (lambda nil (local-set-key (kbd C-c <) 'shrink_sidebar) (local-set-key (kbd C-c >) 'enlarge_sidebar) (local-set-key (kbd C-c C-d) 'default_sidebar)) | diredp-nb-marked-in-mode-name | diredp--set-up-font-locking | dired-extra-startup | (lambda nil (local-set-key (kbd C-c <) 'shrink_sidebar) (local-set-key (kbd C-c >) 'enlarge_sidebar)) | doom-modeline-set-project-modeline |

 #+begin_src emacs-lisp 
 (global-set-key (kbd "C-x C-n") 'dired-sidebar-toggle-sidebar)
 #+end_src 

* Cpp

  Activate =hs-mode= when opening cpp files to navigate them quickly.

#+begin_src emacs-lisp 
(add-hook 'c-mode-common-hook 'hs-minor-mode)
#+end_src 

#+RESULTS:
| hs-minor-mode | smart-hungry-delete-default-c-mode-common-hook |


*** Sychronization with Google Calendar

You have to mask this one if you want to push on GitHub. 

Here you mask your settings through a json
#+begin_src emacs-lisp 
(require 'json)

(setq credID (let* ((json-object-type 'hash-table)
		      (json-array-type 'list)
		      (json-key-type 'string)
		      (json (json-read-file "/Users/marcohassan/Desktop/emacs_config/Emacs Configuration/credentials/gCred.json")))
		  (gethash "client-id" json)))

(setq secret (let* ((json-object-type 'hash-table)
		      (json-array-type 'list)
		      (json-key-type 'string)
		      (json (json-read-file "/Users/marcohassan/Desktop/emacs_config/Emacs Configuration/credentials/gCred.json")))
		  (gethash "secret" json)))
#+end_src 

#+begin_src emacs-lisp 
(setq package-check-signature nil)

(use-package org-gcal
  :ensure t
  :config
  (setq org-gcal-client-id credID 
	org-gcal-client-secret secret
	org-gcal-file-alist) '(("marco.hassan30@gmail.com" .  "~/dropbox/Applicazioni/MobileOrg/mobileorg.org")));
#+end_src 

#+RESULTS:
: t

#+begin_src emacs-lisp 
(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
#+end_src 

#+RESULTS:
| lambda | nil | (org-gcal-sync) |

* Time management and Pomodoro Technique
  :LOGBOOK:
  CLOCK: [2021-02-05 Fri 12:02]--[2021-02-05 Fri 12:15] =>  0:13
  CLOCK: [2021-02-05 Fri 11:48]--[2021-02-05 Fri 12:01] =>  0:13
  CLOCK: [2021-02-05 Fri 11:43]--[2021-02-05 Fri 11:48] =>  0:05
  CLOCK: [2021-02-05 Fri 11:39]--[2021-02-05 Fri 11:42] =>  0:03
  CLOCK: [2021-02-05 Fri 11:39]--[2021-02-05 Fri 11:39] =>  0:00
  :END:

  This section experiments a bit with some time management
  techniques. I discovered it is not just bla bla. You can in fact
  work much more productively with basics time management
  techniques. I started using some during my last exam session. It was
  a hard one and I was often distracted. Well I decided to set
  timers. During some time I was working. Then I was regularly doing
  breaks reading my current book. It worked and I managed to read 250
  pages during the most hard exam session I ever experienced. 

  It turned out when discussing with my dare gf, that there is a very
  well known technique that supports such a behaviour. It is the
  pomodoro technique. It consists in measuring everything in
  pomodoros. That is 25min. intervals.

  During such intervals you work at 100% without any distractions and
  then from time to time you take breaks and switch off. But when you
  work you work at 100%. You do not mix stuff.

  Let's start with the basics in emacs. And let's then expand to the
  pomodoro.

  
* Latex

#+begin_src emacs-lisp 
(setq exec-path (append exec-path '("/usr/texbin")))
#+end_src 

#+begin_src emacs-lisp 
(add-to-list 'org-latex-packages-alist '("" "listingsutf8"))
(add-to-list 'org-latex-packages-alist '("" "minted"))
#+end_src 

You have to have xelatex on your $PATH for that.

Good - notice that this first chunck works well when you want to allow
minted content in your files. 

#+begin_src emacs-lisp 
   ;; Allowing minted to highlight code in latex mode when exporting
   
   (setq org-latex-pdf-process
	 '("xelatex -8bit -shell-escape  -interaction nonstopmode -output-directory %o %f"
            "bibtex %b"
	   "xelatex -8bit -shell-escape  -interaction nonstopmode -output-directory %o %f"
	   "xelatex -8bit -shell-escape  -interaction nonstopmode -output-directory %o %f"))


   (setq org-latex-listings 'minted)
   (setq org-latex-minted-options
	 '(("frame" "lines") ("linenos=true")))
#+end_src 

#+RESULTS:
| frame        | lines |
| linenos=true |       |

#+begin_src emacs-lisp 
;; For working with org-ref and having correct export.
;; (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
#+end_src 

Then compile the latex with =C-c C-c= command.

** Citation in Org-mode
 
   Note that since a bit in newer versions of org-mode you do not have
   anymore contributed packages. I needed ox-bibtex in there. I also
   could not find it in /epkgs/. So I downloaded it manually and moved
   the =contrib= folder of older org-mode versions to the =.emacs.d= folder.

#+begin_src emacs-lisp 
;; to add ox-bibtex add the path
(add-to-list 'load-path "/Users/marcohassan/.emacs.d/org_mode_contrib/lisp/")
(require 'ox-bibtex)
(require 'org-bibtex)
(require 'bibtex-completion) ;; had also to install this manually
#+end_src 

#+RESULTS:
: bibtex-completion

There is some issue with helm-bibtex, this was a dependency of
org-ref. I uninstalled both and now I solved the issue. A new bibtex
version was installed that seems to integrate correctly now.

Needed as well =bibtex2html=. Can be installed with brew.

#+begin_src emacs-lisp 
;; use the quelpa mirror because of that
 (use-package org-ref
   :ensure t
   :quelpa (org-ref :fetcher github :repo "emacsmirror/org-ref")
   :bind (
          ("C-x s-c" . org-ref-helm-insert-cite-link)
          ("C-x s-o" . org-ref-open-url-at-point)
         )
)
#+end_src 

#+RESULTS:
: org-ref-open-url-at-point


#+begin_src emacs-lisp 
(setq reftex-default-bibliography '("/Users/marcohassan/Desktop/Bayesian_Net_Thesis/literature/references.bib"))

;; see org-ref for use of these variables
(setq  org-ref-bibliography-notes "~/Desktop/Bayesian_Net_Thesis/literature/notes.org"
       org-ref-default-bibliography '("~/Desktop/Bayesian_Net_Thesis/literature/references.bib")
       org-ref-pdf-directory "~/Desktop/Thesis/Bayesian_Net_Thesis/bibtex-pdfs/")
#+end_src 

#+RESULTS:
: ~/Desktop/Thesis/Bayesian_Net_Thesis/bibtex-pdfs/

In general it is working like a charm. I just have to change some
bindings. Find the functionalities of it [[https://www.youtube.com/watch?v=2t925KRBbFc][here]]. 

I love =org-ref= it is an outstanding package. Note that for some
reason every time I open a file after reopening emacs the file does
not check the link with the bibliography. I have to manually call
the =org-ref-insert-bibliography-link=. This is annoying. Try to solve
this issue at some point. Also some functions are missing. Such as
this very labels tags. After calling a function such as
=org-ref-insert-ref-link= they appear. Weird behaviour. Something is
for sure broken. A pity that this library is not well maintained. It
is a bomb but it refers and leverage old libraries. [[label:issue_link_at_startup]]

Note that at this stage I am was not able to download the papers
directly. I will fix it at some point later if I manage. [[label:issue_pdf_downlaod]]


** Config

 *Necessary dependencies:*

 *For Python:* In order to use the python language server you have to install it via
 pip first =pip3 install python-language-server=.

 *For Cpp:* Need clangd in your =PATH=. Install it on Mac via ~brew install llvm~.


 #+begin_src emacs-lisp 
(use-package lsp-mode
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (python-mode . lsp)

         ;; note not using here as there is some issue. have to use
         ;; clangd compiler but I am using g++ for the project. takes
         ;; to long to fix all of this.  

         ;; (c-mode . lsp) (c++-mode
         ;; . lsp)

         ;; if you want which-key integration
         ;; (lsp-mode . lsp-enable-which-key-integration)
	 )
  :commands lsp
  )
 #+end_src

 #+RESULTS:

 Some config.

 #+begin_src emacs-lisp 
;; company completing
(setq lsp-prefer-capf t)
(setq gc-cons-threshold 100000000)
;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
(setq lsp-keymap-prefix "C-c s-l")
 #+end_src 

 #+RESULTS:
 : C-c s-l

 Notice that you have to toggle
 =lsp-ui-sidebar-toggle-symbols-info=. This is a very valuable thing to
 do.

 #+begin_src emacs-lisp 
(use-package lsp-ui
  :custom-face
  (lsp-ui-sideline-code-action ((t (:inherit warning))))
  :hook (lsp-mode . lsp-ui-mode)
  :init (setq lsp-ui-doc-enable t
	      lsp-ui-doc-use-webkit nil
	      lsp-ui-doc-delay 0.5
	      lsp-ui-doc-include-signature t
	      lsp-ui-doc-position 'top
	      lsp-ui-doc-border (face-foreground 'default)
	      lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer

	      lsp-ui-sideline-enable t
	      lsp-ui-sideline-show-hover nil
	      lsp-ui-sideline-show-diagnostics nil
	      lsp-ui-sideline-ignore-duplicate t

	      lsp-ui-imenu-enable t
	      lsp-ui-imenu-colors `(,(face-foreground 'font-lock-keyword-face)
				    ,(face-foreground 'font-lock-string-face)
				    ,(face-foreground 'font-lock-constant-face)
				    ,(face-foreground 'font-lock-variable-name-face)))

  :config
  (add-to-list 'lsp-ui-doc-frame-parameters '(right-fringe . 8))

  ;; `C-g'to close doc
  (advice-add #'keyboard-quit :before #'lsp-ui-doc-hide)

  ;; Reset `lsp-ui-doc-background' after loading theme
  (add-hook 'after-load-theme-hook
	    (lambda ()
	      (setq lsp-ui-doc-border (face-foreground 'default))
	      (set-face-background 'lsp-ui-doc-background
				   (face-background 'tooltip)))))
 #+end_src 

 #+RESULTS:
 | lsp-ui-mode |

 To integrate further and to resolve the issue with python debugging.

 https://github.com/emacsmirror/dap-mode#installation-1

 #+begin_src emacs-lisp 
 (use-package dap-mode
   :quelpa (dap-mode :fetcher github :repo "emacsmirror/dap-mode"))

(require 'dap-python)

  #+end_src 

 Moreover it is possible to integrate the language server with org in
 the editing buffer of =C-'=.

 This was not integrated so far. You can read more about that [[https://github.com/emacs-lsp/lsp-mode/issues/377][here]].

 #+begin_src emacs-lisp 
(defun org-babel-edit-prep:python (babel-info)
  (setq-local buffer-file-name (->> babel-info caddr (alist-get :file-name)))
  (setq-local lsp-buffer-uri (->> babel-info caddr (alist-get :file-name) lsp--path-to-uri))
  (lsp)

    (use-package py-autopep8
      :ensure t)
    (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)

    (pyvenv-mode t) 
    (undo-tree-mode t) 
    (flycheck-mode t)
    (company-mode t)
    (setq venv-location "/Users/marcohassan/Desktop/python_venv")

    ;; Add hook for còmment highlighting.
    ;;(add-hook 'python-mode-hook 'add-custom-keyw)
  )
 #+end_src 

 Hack for =ein-python=. Transform it to python source block and then open
 the edit buffer. Like this you will have the language server. Then
 when closing it back change the header back to =ein-python=.

 #+begin_src emacs-lisp 
(defun ein_copy_packages ()
 (scimax-ob-jump-to-end)
 (search-backward "ein-python")
 (kill-word 1)
 (delete-char 1)
 (next-line)
 (save-excursion
 (search-backward "#!START_LIB")
 (next-line)
 (beginning-of-line)
 (setq p2 (point))
 (scimax-ob-jump-to-end)
 (previous-line)
 (end-of-line)
 (copy-region-as-kill p2 (point))))


(defun ein_python ()
 (interactive)
 (ein_copy_packages)
 (scimax-ob-jump-to-header)
 (next-line)
 (newline)
 (yank)
 (newline 2)
 (org-edit-special)
)

(defun ein_python_exit ()
 (interactive)
 (goto-char (point-max))
 (search-backward "#!END_LIB")
 (end-of-line)
 (setq p (point))
 (goto-char (point-min))
 (delete-region p (point))
 (kill-line 2)
 (org-edit-src-exit)
 (search-backward "python")
 (insert "ein-")
)

;; map the two to shortcuts
(eval-after-load 'org' (progn 
			 (define-key org-mode-map
			   (kbd "C-c s-'") 'ein_python)
			 (define-key python-mode-map
			   (kbd "C-c s-'") 'ein_python_exit)
			 ))
 #+end_src 

 Super nice with the tangle property. You write all of the chuncks then
 to a single file you can pass as =:tangle= argument.

